[
    "Hey! I'm Kanishq, a 16 year old high school student that loves programming.",
    "I'm currently a junior at Pomperaug High School in Connecticut, but I spend most of my free time either working on Ilios Labs or chatting with my friends on Discord.",
    "I also work as a web developer for a learning center near me, and I'm the primary maintainer for their website.",
    "I'm currently looking for a programming position at Discord because I'm a huge fan of the community and I want to help make it a better place for everyone.",
    "To get a download of my cover letter, press the skip button on the top right and press the 'Download' button. To view my resume, check out my personal website at https://neesh.ilioslabs.dev/resume",
    "So...why do I think I'm fit for a company like Discord? Well, for starters, I've been programming for over 7 years, trying new languages like Python, Javascript, and HTML/CSS.",
    "Now, that might not be too impressive on its own but I've taught them all to myself using online courses and creating projects to jump right into the language, which you can see on my Github.",
    "I love solving difficult problems and overcoming those kinds of obstacles in my projects",
    "I'm also a team worker. I hate working on things alone and I'm always looking for feedback or criticism from others so I can improve myself and take a look at things from a different view.",
    "My whole quest as a programmer is to make people's lives easier, which is why I started Ilios Labs, and over the past few years, I've integrated Discord heavily into my workflow because of how convenient it makes communicating with my friends and getting help from others.",
    "What projects have I created, you might be asking. Well, I can show you!",
    "I created a Discord Bot that uses an API to compile code and also create pastes using PasteBin. It accepts inputs, over 20 languages, and uses the latest Discord features to make it a great experience.",
    "I can create a simple code snippet here and show you...",
    "codeconsole.log(\"Hello World!\")",
    "Now, I can use a context menu to compile this code.",
    {
        "type": "command",
        "bot": "Codetta",
        "avatar": "https://cdn.discordapp.com/avatars/842011358493016105/c84634b1a1a07b45640ba677d9d4ce3b.png?size=1024",
        "command": "compile",
        "response": {
            "title": "🟢 Accepted",
            "description": "Code Compiled Successfully!",
            "thumbnail": "https://images-ext-1.discordapp.net/external/a5ub1aXk_eDv16NQTEotP3tChTksjJ1LvsDLgVAzmRA/https/upload.wikimedia.org/wikipedia/commons/thumb/9/99/Unofficial_JavaScript_logo_2.svg/1200px-Unofficial_JavaScript_logo_2.svg.png?width=977&height=977",
            "fields": [
                {
                    "name": "Output",
                    "value": "Hello World!",
                    "inline": true,
                    "inlineIndex": 1
                },
                {
                    "name": "Status",
                    "value": "Accepted",
                    "inline": true,
                    "inlineIndex": 2
                },
                {
                    "name": "Time",
                    "value": "0.042ms",
                    "inline": true,
                    "inlineIndex": 1
                },
                {
                    "name": "Ran in",
                    "value": "Javascript (Node.js 12.14.0)",
                    "inline": true,
                    "inlineIndex": 2
                },
                {
                    "name": "Input",
                    "value": "None",
                    "inline": true,
                    "inlineIndex": 3
                },
                {
                    "name": "Token",
                    "value": "5d14d6f5-6db3-4436-8473-52ca49a133fc",
                    "inline": false
                }
            ]
        }
    },
    "Check out Codetta at https://github.com/Neesh774/Codetta",
    "That's it! Thank you for staying around to check out this website, and I can't wait to hear your response."
]